<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''SELECT COUNT(*)
                FROM vacancies
'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3604050397.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''SELECT COUNT(*)
                FROM EMPLOYERS
'''

In [7]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3655965175.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = f'''SELECT COUNT(*)
                FROM AREAS
'''

In [9]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3731397118.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''SELECT COUNT(*)
                FROM INDUSTRIES
'''

In [11]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\619965657.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [12]:
# выводы по предварительному анализу данных
# Количество работодателей и вакансии имеет разницу в два раза.
# Скорее всего это из за крупный работодателей у который может быть очень много вакансий.
# Регион 1362 больше чем всех регионова в России. На момент 2023 года их 1118.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
query_4_1 = f'''SELECT count(v.id),a.name
                FROM VACANCIES v JOIN AREAS a ON v.area_id = a.id
                GROUP by a.name
                ORDER BY 1 DESC LIMIT 5
'''

In [14]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\234815181.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

   count             name
0   5333           Москва
1   2851  Санкт-Петербург
2   2112            Минск
3   2006      Новосибирск
4   1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
# текст запроса
query_4_2 = f'''SELECT count(v.id)
                FROM VACANCIES v 
                WHERE v.salary_to IS NOT NULL  OR v.salary_from IS NOT NULL
'''

In [16]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3734613624.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:

query_4_3_up = f'''SELECT ROUND(AVG(v.salary_to),0) AS up
                FROM VACANCIES v 
'''
query_4_3_down = f'''SELECT ROUND(AVG(v.salary_from),0) as down
                    FROM VACANCIES v
'''

In [18]:
# результат запроса
up = pd.read_sql_query(query_4_3_up, connection)
display(up)
down = pd.read_sql_query(query_4_3_down, connection)
display(down)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\4180934551.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  up = pd.read_sql_query(query_4_3_up, connection)

         up
0  110537.0

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\4180934551.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  down = pd.read_sql_query(query_4_3_down, connection)

      down
0  71065.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
# текст запроса
query_4_4 = f'''SELECT COUNT(v.id),v.schedule, v.employment
                FROM VACANCIES v
                GROUP BY v.schedule, v.employment
                ORDER BY 1 DESC LIMIT 1 OFFSET 1
'''

In [20]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3274844153.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

   count          schedule        employment
0   7802  Удаленная работа  Полная занятость

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
# текст запроса
query_4_5 = f'''SELECT COUNT(v.id),v.experience
                FROM VACANCIES v
                GROUP BY v.experience
                ORDER BY 1
'''

In [22]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\969833449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

   count          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

***

In [1]:
# выводы по детальному анализу вакансий
# Основное колличество вакансий, как не парадоксально, присутсвуют в крупнейших городах миллиоников.
# Почти у половины всех  вакансий в бд, присутствует хотя бы 1 из 2 полей с заработной платой.
# По большей части это связанно с тем, что не все работодатели устанавливают зп.
# Разница между нижней и верхней зарплатной вилки не такая уж и большая всего 40 к.
# Удалённая работа впринципе в приоритете, как ты можно работать из любого места, где есть интернет.
# Более 6 лет, это очень узко специализированные вакансии. В которых нужны настоящие мастера своего дела.
# Без опыта, обычно подразумеваються вакансии где работника научат уже во время работы или проведу стажировку
# А опыт от года самые популярный вакансии, тоесть достаточно чтобы человек имел довольно не большой опыт, чтобы приступить сразу
# непосредственно к работе.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [24]:
# текст запроса
query_5_1 = f'''(SELECT COUNT(v.id),e.name
                FROM VACANCIES v JOIN EMPLOYERS e ON v.employer_id = e.id
                GROUP BY e.name
                Order by 1 DESC LIMIT 1)

                UNION ALL

                (SELECT COUNT(v.id),e.name
                FROM VACANCIES v JOIN EMPLOYERS e ON v.employer_id = e.id
                GROUP BY e.name
                Order by 1 DESC LIMIT 1 OFFSET 4)

'''

In [25]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\1127888558.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

   count           name
0   1933         Яндекс
1    331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [26]:
# текст запроса
query_5_2 = f'''SELECT  a.name , COUNT(e.id) , v.name
                FROM AREAS a

                LEFT JOIN VACANCIES v  ON v.area_id = a.id
                LEFT JOIN EMPLOYERS e ON e.area = a.id
                GROUP BY a.name, v.name
                having v.name IS NULL
                ORDER BY 2 DESC LIMIT 1
'''

In [27]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\2002098862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

     name  count  name
0  Россия    410  None

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [28]:
# текст запроса
query_5_3 = f'''SELECT e.name , count(distinct(v.area_id))
                FROM employers e
                LEFT JOIN vacancies v ON v.employer_id = e.id
                GROUP BY e.id
                ORDER BY 2 desc LIMIT 1

'''

In [29]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3953667891.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

     name  count
0  Яндекс    181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [30]:
# текст запроса
query_5_4 = f'''SELECT count(e.id)
                FROM EMPLOYERS e
                LEFT JOIN EMPLOYERS_INDUSTRIES ei ON ei.employer_id = e.id
                LEFT JOIN INDUSTRIES i ON ei.industry_id = i.id
                WHERE i.name IS NULL

'''

In [31]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\375529716.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [32]:
# текст запроса
query_5_5 = f'''
                SELECT e.name
                FROM EMPLOYERS e
                LEFT JOIN EMPLOYERS_INDUSTRIES ei ON ei.employer_id = e.id
                LEFT JOIN INDUSTRIES i ON ei.industry_id = i.id
                GROUP BY e.id
                HAVING count(i.id) = 4
                ORDER BY 1 OFFSET 2 LIMIT 1
'''

In [33]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3277383447.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [34]:
# текст запроса
query_5_6 = f'''SELECT COUNT(e.name)
                FROM EMPLOYERS e
                JOIN EMPLOYERS_INDUSTRIES ei ON ei.employer_id = e.id
                JOIN INDUSTRIES i ON ei.industry_id = i.id
                WHERE i.name LIKE 'Разработка программного обеспечения'
'''

In [35]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\1761488907.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [36]:
# код для получения списка городов-милионников
# Я не стал брать ибо считаю что для этого задания это не к месту.
# Так как города можно просто перечислить их не так уж много.

In [37]:
# текст запроса
query_5_7 = f'''(SELECT a.name, count(v.name) cnt
                FROM VACANCIES v
                JOIN employers e ON v.employer_id = e.id
                JOIN AREAS a ON v.area_id = a.id
                WHERE e.name LIKE 'Яндекс' AND a.name in ('Москва', 'Санкт-Петербург',
                'Новосибирск','Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск',
                'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар',
                'Воронеж', 'Пермь', 'Волгоград')
                GROUP BY a.name
)

UNION all
(
                SELECT 'Total', count(v.name) cnt
                FROM VACANCIES v
                JOIN employers e ON v.employer_id = e.id
                JOIN AREAS a ON v.area_id = a.id
                WHERE e.name LIKE 'Яндекс' 
                AND a.name in ('Москва', 'Санкт-Петербург',
                'Новосибирск','Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск',
                'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар',
                'Воронеж', 'Пермь', 'Волгоград')
)
                ORDER BY 2
'''

In [38]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\4127784153.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485

***

In [39]:
# выводы по анализу работодателей
# Как мы видим, даже у Самой богатой компании России газпром нефть, меньше вакансий чем у Компании Яндекс.
# Наибольшее количество работодатлей где нет вакансий находяться в регионе Россия. Скорее всего из за того что в этом регионе
# впринципе больше всего работаделей.
# Из всех работодателей наибольшее колличество регионов которое он охватывает это 181
# Не нашёл причины почему 8419 работодателей не указывают сферы деятельности. Предположу что скорее всего этим работодателем не важен
# навыки работника, пример(уборщик, кассир и тд) либо забыли указать.
# В больших компания как 2Гис нужны обычно разношёрстная команда, поэтому столько там сфер деятельности.
# Также приемлемое количество работодатаделей указывают в сфере деятельности Разработка по. Но не так много как без сфер деятельности
# В компании Яндекс начиная с Москвы количество вакансий постепенно сокращаеться, чем меньше людей в городе тем меньше колличество вакансий, 
# можно было подумать, но нет. Вот пример Екатеринбург имеет больше Вакансий чем в Городе Новосибирск, хотя в новосибирске 1 635 тысяч людей
# а в Екатеринбурге 1 539 тысяч людей. Вывод в том что колличество Вакансий некоторых работодателей не зависит от полностью от населения.
# Есть и другие факторы, или точнее тактики которому следовали работадели когда открывали филлиалы и выставляли вакансии.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [40]:
# текст запроса
query_6_1 = f'''
SELECT COUNT(v.id)
FROM VACANCIES v
WHERE LOWER(v.name) LIKE '%data%' OR LOWER(v.name) LIKE '%данн%'
'''

In [41]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\2931938894.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [42]:
# текст запроса
query_6_2 = f'''
SELECT count(v.name)
            
FROM VACANCIES v   
WHERE  (LOWER(v.name) like '%data scientist%' or LOWER(v.name) like '%data science%' or LOWER(v.name) like '%исследователь данных%' or 
        LOWER(v.name) like '%machine learning%' or LOWER(v.name) like '%машинн%обучен%' or  (v.name not like '%HTML%' and v.name like '%ML%')) and 
        (LOWER(v.name) like '%junior%'or v.experience like 'Нет опыта' or v.employment  like 'Стажировка')
'''

In [43]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\700150659.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [44]:
# текст запроса
query_6_3 = f'''
SELECT count(v.name)
            
FROM VACANCIES v   
WHERE  (LOWER(v.name) like '%data scientist%' or LOWER(v.name) like '%data science%' or LOWER(v.name) like '%исследователь данных%' or 
        LOWER(v.name) like '%machine learning%' or LOWER(v.name) like '%машинн%обучен%' or  (v.name not like '%HTML%' and v.name like '%ML%')) and 
        (LOWER(v.key_skills) LIKE '%sql%' OR  LOWER(v.key_skills) LIKE '%postgres%')
'''

In [45]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\1206811184.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [46]:
# текст запроса
query_6_4 = f'''
SELECT count(v.name)
            
FROM VACANCIES v   
WHERE  (LOWER(v.name) like '%data scientist%' or LOWER(v.name) like '%data science%' or LOWER(v.name) like '%исследователь данных%' or 
        LOWER(v.name) like '%machine learning%' or LOWER(v.name) like '%машинн%обучен%' or  (v.name not like '%HTML%' and v.name like '%ML%'))and 
        (LOWER(v.key_skills) LIKE '%python%')
'''

In [47]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\4143830933.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [48]:
# текст запроса
query_6_5 = f'''
SELECT ROUND(AVG(length(v.key_skills) - length(replace(v.key_skills, CHR(9), ''))+1),2)
        

FROM VACANCIES v   
WHERE  (LOWER(v.name) like '%data scientist%' or LOWER(v.name) like '%data science%' or LOWER(v.name) like '%исследователь данных%' or 
        LOWER(v.name) like '%machine learning%' or LOWER(v.name) like '%машинн%обучен%' or  (v.name not like '%HTML%' and v.name like '%ML%'))
        and v.key_skills IS NOT NULL
'''

In [49]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
display(df)

C:\Users\Максим\AppData\Local\Temp\ipykernel_9276\3940953658.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [50]:
# текст запроса
query_6_6 = f'''
SELECT ROUND(AVG(coalesce((v.salary_from + v.salary_to) / 2, v.salary_from, v.salary_to)), 0), v.experience
        

FROM VACANCIES v   
WHERE  (LOWER(v.name) like '%data scientist%' or LOWER(v.name) like '%data science%' or LOWER(v.name) like '%исследователь данных%' or 
        LOWER(v.name) like '%machine learning%' or LOWER(v.name) like '%машинн%обучен%' or  (v.name not like '%HTML%' and v.name like '%ML%'))
        and (v.salary_to IS NOT NULL or v.salary_from IS NOT NULL) and v.experience LIKE 'От 3 до 6 лет'
GROUP BY v.experience

'''

In [ ]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
display(df)

***

In [2]:
# выводы по предметному анализу
# Общее колличество вакансий имеющая отношения в данныхм иммеют колличество 1771.
# Из их лишь 51 джуниоры туда входят ещё кандинаты без опыта или стажёры.
# В разы больше работодатели указывают в умениях работать с sql или postgres 201. Так как это очень важное умение для дата сайнтиста.
# Но язык программирование Python имеет основу для работы дата сайнтистом, поэтому вакансии где он требуеться больше умение работать с sql
# на 150.
# В среднем около 6 ключевых навыков указывают работодатели в вакансиях для DS, так как важно умения работать не только с пару приложениями,а 
# с нескольмими для правильного составления прогноза.
# После 3 -6 лет  работы работнику в среднемне следует надеяться на зарплату около 240 тысяч.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
# Вывод можно сделать в том, что в больших городах, особенно такие как Москва, зачастую больше вакансий, но размер города не
# всегда влият на колличество вакансий.
# Также в половине из всех вакансий, работодатели не указывают зарабатную плату.
# Удалённая работа и полный день работы очень сильно всотребованны в вакансиях.
# Компания Яндекс лидирует по колличеству вакансий.
# Также у 1/3 всех работодателей указано в сфере деятельности, разработка по. Говороит о том что Разработка по очень популярно, так как нужно
# почти во всех сферах деятельности.
# Джуниоров, стажеров или людей без опыта, ищут в разы реже в сфере дата сайнс.
# Python чаще sql встречаеться в требованих вакансии на должность дата сайнс.
# Обычно около 6 ключевых навыков указывают работодатели, от этом я уточню ниже
# Из всего вывода можно сделать вывод, что работа дата сайнтистом приносит много прибыли, а также требует
# больше знаний и соответственно требований от работодателя. А аткже хотелось уточнить что зарабатная плата выше чем среднее значение
# из верхней зарплатной вилки.